# Data Indexing and Selection

In [1]:
import pandas as pd
import numpy as np

In [2]:
data_frame = pd.read_csv("students.csv")
data_frame

      id name   age gender  quiz1  quiz2  midsem  compre promoted
0    1.0    A  13.0      F    9.0    7.0    30.0    49.0        Y
1    2.0    B  14.0      F    3.0    8.0    20.0    41.0        Y
2    3.0    C  12.0      M    5.0    2.0    23.0    39.0        Y
3    4.0    D  12.0      M    7.0    4.0    25.0    27.0        Y
4    5.0    E  13.0      F    2.0    6.0    13.0    15.0        N
5    6.0    F  14.0      M    1.0    8.0    17.0    44.0        Y
6    7.0    G  12.0      F    9.0    1.0    39.0    41.0        Y
7    8.0    H  13.0      F   10.0    9.0    35.0    37.0        Y
8    9.0    I  12.0      M   10.0    9.0    34.0    33.0        Y
9   10.0    J  14.0      M    3.0    4.0    31.0    36.0        Y
10   NaN  NaN   NaN    NaN    NaN    NaN     NaN     NaN        Y

<b> Viewing index and columns names <b>

In [3]:
data_frame.index

RangeIndex(start=0, stop=11, step=1)

In [4]:
data_frame.columns

Index(['id', 'name', 'age', 'gender', 'quiz1', 'quiz2', 'midsem', 'compre',
       'promoted'],
      dtype='object')

In [5]:
data_frame.dtypes

id          float64
name         object
age         float64
gender       object
quiz1       float64
quiz2       float64
midsem      float64
compre      float64
promoted     object
dtype: object

<b> Viewing Data <b>

head() helps to view topn rows. Default is 5 rows.

In [6]:
data_frame.head()

    id name   age gender  quiz1  quiz2  midsem  compre promoted
0  1.0    A  13.0      F    9.0    7.0    30.0    49.0        Y
1  2.0    B  14.0      F    3.0    8.0    20.0    41.0        Y
2  3.0    C  12.0      M    5.0    2.0    23.0    39.0        Y
3  4.0    D  12.0      M    7.0    4.0    25.0    27.0        Y
4  5.0    E  13.0      F    2.0    6.0    13.0    15.0        N

In [7]:
#top n rows can be see by passing the topn value
data_frame.head(2)

    id name   age gender  quiz1  quiz2  midsem  compre promoted
0  1.0    A  13.0      F    9.0    7.0    30.0    49.0        Y
1  2.0    B  14.0      F    3.0    8.0    20.0    41.0        Y

tail() helps to view bottom n rows. Default is 5 rows.

In [8]:
data_frame.tail()

      id name   age gender  quiz1  quiz2  midsem  compre promoted
6    7.0    G  12.0      F    9.0    1.0    39.0    41.0        Y
7    8.0    H  13.0      F   10.0    9.0    35.0    37.0        Y
8    9.0    I  12.0      M   10.0    9.0    34.0    33.0        Y
9   10.0    J  14.0      M    3.0    4.0    31.0    36.0        Y
10   NaN  NaN   NaN    NaN    NaN    NaN     NaN     NaN        Y

In [9]:
data_frame.tail(2)

      id name   age gender  quiz1  quiz2  midsem  compre promoted
9   10.0    J  14.0      M    3.0    4.0    31.0    36.0        Y
10   NaN  NaN   NaN    NaN    NaN    NaN     NaN     NaN        Y

<b> Column Selection<b>

Acceess individual columns by its name. i.e. data_frame_obj.column_name

In [10]:
data_frame.id # returns index and data values

0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6      7.0
7      8.0
8      9.0
9     10.0
10     NaN
Name: id, dtype: float64

Basically its a series and then all series operations can be performed on it.

In [11]:
type(data_frame.id)

pandas.core.series.Series

[] operator can also be used to access the column. The result is also a series.

In [12]:
data_frame["name"]

0       A
1       B
2       C
3       D
4       E
5       F
6       G
7       H
8       I
9       J
10    NaN
Name: name, dtype: object

In [13]:
type(data_frame["name"])

pandas.core.series.Series

List of columns can be accessed as follows :

In [14]:
list_of_columns= ["id", "name"]
data_frame[list_of_columns]

      id name
0    1.0    A
1    2.0    B
2    3.0    C
3    4.0    D
4    5.0    E
5    6.0    F
6    7.0    G
7    8.0    H
8    9.0    I
9   10.0    J
10   NaN  NaN

But this time, the outcome is data frame not a series.

In [15]:
type(data_frame[list_of_columns])

pandas.core.frame.DataFrame

In [16]:
sub_df = data_frame[list_of_columns]
sub_df

      id name
0    1.0    A
1    2.0    B
2    3.0    C
3    4.0    D
4    5.0    E
5    6.0    F
6    7.0    G
7    8.0    H
8    9.0    I
9   10.0    J
10   NaN  NaN

<b>Different Choices for Indexing<b>

Object selection has had a number of user-requested additions in order to support more explicit location based indexing. <br>

<b>.loc </b>is primarily label based, but may also be used with a boolean array. .loc will raise KeyError when the items are not found. Allowed inputs are:<br>

- A single label, e.g. 5 or 'a' (Note that 5 is interpreted as a label of the index. This use is not an integer position along the index.).
- A list or array of labels ['a', 'b', 'c'].
- A slice object with labels 'a':'f' (Note that contrary to usual python slices, both the start and the stop are included, when present in the index! See Slicing with labels.).
- A boolean array<br>

<b>.iloc </b>is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array. .iloc will raise IndexError if a requested indexer is out-of-bounds, except slice indexers which allow out-of-bounds indexing. (this conforms with Python/NumPy slice semantics). Allowed inputs are: <br>

- An integer e.g. 5.
- A list or array of integers [4, 3, 0].
- A slice object with ints 1:7.
- A boolean array.

<b> Using .loc <b>

In [17]:
data_frame

      id name   age gender  quiz1  quiz2  midsem  compre promoted
0    1.0    A  13.0      F    9.0    7.0    30.0    49.0        Y
1    2.0    B  14.0      F    3.0    8.0    20.0    41.0        Y
2    3.0    C  12.0      M    5.0    2.0    23.0    39.0        Y
3    4.0    D  12.0      M    7.0    4.0    25.0    27.0        Y
4    5.0    E  13.0      F    2.0    6.0    13.0    15.0        N
5    6.0    F  14.0      M    1.0    8.0    17.0    44.0        Y
6    7.0    G  12.0      F    9.0    1.0    39.0    41.0        Y
7    8.0    H  13.0      F   10.0    9.0    35.0    37.0        Y
8    9.0    I  12.0      M   10.0    9.0    34.0    33.0        Y
9   10.0    J  14.0      M    3.0    4.0    31.0    36.0        Y
10   NaN  NaN   NaN    NaN    NaN    NaN     NaN     NaN        Y

Access the first row in the data frame using the index

In [18]:
data_frame.loc[0]

id           1.0
name           A
age         13.0
gender         F
quiz1        9.0
quiz2        7.0
midsem      30.0
compre      49.0
promoted       Y
Name: 0, dtype: object

Access the intermediate rows in the data frame using the index

In [ ]:
data_frame.loc[1:3]

With index, column names can also be specified in order to access value for those columns only.

In [ ]:
data_frame.loc[0, "id"]

In [ ]:
data_frame.loc[0, ['id', 'name', 'quiz1']]

Other variations

In [ ]:
#Get all the row after index 2
data_frame.loc[2:]

In [ ]:
#Get all the rows having index less than 3
data_frame.loc[: 3]

In [ ]:
#Get alternate rows
data_frame.loc[::2]

In [ ]:
data_frame.loc[0, 'name']

In [ ]:
data_frame.loc[0:2, ['id', 'name', 'quiz1']]

<b> Using .iloc<b>

Integer indices are only used to access the values.

In [ ]:
data_frame

In [ ]:
#Access the zeroth row
data_frame.iloc[0]

In [ ]:
#Access first three rows
data_frame.iloc[0:3]

In [ ]:
#Acess every alternate row
data_frame.iloc[::2]

In [ ]:
#Acces zeroth row , zeroth column
data_frame.iloc[0, 0]

In [ ]:
#Aceess first two columns of row with index 1 i.e. second row
data_frame.iloc[1, 0:2]

In [ ]:
#Access explicit columns of second row
data_frame.iloc[1, [0, 2, 3]]

<b> Filtering<b>

Filter conditions can be used in [] to select the few specific rows.

In [ ]:
data_frame

In [ ]:
#Access the rows which fulfills the condition
data_frame[ data_frame.quiz1 > 3]

In [ ]:
#Access the rows which fulfills both condition
data_frame[ (data_frame.quiz1 > 3) & (data_frame.quiz2 > 3)]

In [ ]:
#Access the rows which fulfills either of condition
data_frame[ (data_frame.quiz1 > 1) | (data_frame.quiz2 > 3)]

In [ ]:
#Access the rows which fulfills both condition (with negation)
data_frame[ ~(data_frame.quiz1 > 4)]

<b> Using isin <b>

In [ ]:
data_frame

DataFrame also has an isin() method. When calling isin, pass a set of values as either an array or dict. If values is an array, isin returns a DataFrame of booleans that is the same shape as the original DataFrame, with True wherever the element is in the sequence of values.

In [ ]:
marks = [3, 4]
data_frame.isin(marks)

<b> The query() Method <b>

DataFrame objects have a query() method that allows selection using an expression.
You can get the value of the frame where column b has values between the values of columns a and c.

In [ ]:
data_frame.query('midsem > compre')

In [ ]:
data_frame.query('midsem > compre & quiz1 == quiz2')